
===========================================================================
report_tns
============================================================================
tns -235.07

===========================================================================
report_wns
============================================================================
wns -7.82

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -7.82

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.43
