
===========================================================================
report_tns
============================================================================
tns -0.22

===========================================================================
report_wns
============================================================================
wns -0.22

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.22

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.11
