
===========================================================================
report_tns
============================================================================
tns -226.48

===========================================================================
report_wns
============================================================================
wns -7.54

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -7.54

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.43
