
===========================================================================
report_tns
============================================================================
tns -2.68

===========================================================================
report_wns
============================================================================
wns -0.53

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.53

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.77
