
===========================================================================
report_tns
============================================================================
tns -0.59

===========================================================================
report_wns
============================================================================
wns -0.32

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.32

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.77
