
===========================================================================
report_tns
============================================================================
tns -99.93

===========================================================================
report_wns
============================================================================
wns -3.56

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.56

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.29
