
===========================================================================
report_tns
============================================================================
tns -11.17

===========================================================================
report_wns
============================================================================
wns -0.69

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.69

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.26
