###############################################################################
# Created by write_sdc
# Fri May 23 01:02:31 2025
###############################################################################
current_design zero_to_five_counter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
